Repository: CofficLab/GitOK
Catalog: Plugins/RemoteRepositoryPlugin/Sources/Resources/GitRemoteRepository.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Add
zh_hans: 添加
zh_hk: 加入

source: Add a new Git remote repository
zh_hans: 添加一个新的 Git 远程仓库
zh_hk: 加入一個新的 Git 遠端倉庫

source: Add Remote Repository
zh_hans: 添加远程仓库
zh_hk: 加入遠端倉庫

source: Cancel
zh_hans: 取消
zh_hk: 取消

source: Clear
zh_hans: 清除
zh_hk: 清除

source: Click the button below to add your first remote repository
zh_hans: 点击下方按钮添加第一个远程仓库
zh_hk: 點擊下方按鈕加入第一個遠端倉庫

source: Close
zh_hans: 关闭
zh_hk: 關閉

source: Confirm Delete
zh_hans: 确认删除
zh_hk: 確認刪除

source: Copy Remote URL
zh_hans: 复制远程 URL
zh_hk: 複製遠端 URL

source: Current repository has no publishable branch
zh_hans: 当前仓库没有可发布的分支
zh_hk: 目前倉庫沒有可發布的分支

source: Delete
zh_hans: 删除
zh_hk: 刪除

source: e.g. https://github.com/user/repo.git
zh_hans: 例如 https://github.com/user/repo.git
zh_hk: 例如 https://github.com/user/repo.git

source: e.g. origin
zh_hans: 例如 origin
zh_hk: 例如 origin

source: Edit
zh_hans: 编辑
zh_hk: 編輯

source: Edit Remote Repository
zh_hans: 编辑远程仓库
zh_hk: 編輯遠端倉庫

source: Failed to add remote repository: %@
zh_hans: 添加远程仓库失败：%@
zh_hk: 加入遠端倉庫失敗：%@

source: Failed to delete remote repository: %@
zh_hans: 删除远程仓库失败：%@
zh_hk: 刪除遠端倉庫失敗：%@

source: Failed to load remote repositories: %@
zh_hans: 加载远程仓库失败：%@
zh_hk: 載入遠端倉庫失敗：%@

source: Failed to publish current branch: %@
zh_hans: 发布当前分支失败：%@
zh_hk: 發布目前分支失敗：%@

source: Failed to update remote repository: %@
zh_hans: 更新远程仓库失败：%@
zh_hk: 更新遠端倉庫失敗：%@

source: Loading...
zh_hans: 加载中...
zh_hk: 載入中...

source: Manage Git remote repository configuration for the current project
zh_hans: 管理当前项目的 Git 远程仓库配置
zh_hk: 管理目前專案的 Git 遠端倉庫設定

source: Manage Remote Repositories
zh_hans: 管理远程仓库
zh_hk: 管理遠端倉庫

source: Modify the remote repository's name and URL
zh_hans: 修改远程仓库名称和 URL
zh_hk: 修改遠端倉庫名稱和 URL

source: No project selected
zh_hans: 未选择项目
zh_hk: 未選擇專案

source: No Remote Repositories
zh_hans: 没有远程仓库
zh_hk: 沒有遠端倉庫

source: Open Remote Page
zh_hans: 打开远程页面
zh_hk: 開啟遠端頁面

source: Please add a remote repository first
zh_hans: 请先添加远程仓库
zh_hk: 請先加入遠端倉庫

source: Please fill in all fields
zh_hans: 请填写所有字段
zh_hk: 請填寫所有欄位

source: Please fill in all required information
zh_hans: 请填写所有必填信息
zh_hk: 請填寫所有必填資訊

source: Publish Current Branch
zh_hans: 发布当前分支
zh_hk: 發布目前分支

source: Remote Name
zh_hans: 远程名称
zh_hk: 遠端名稱

source: Remote Repository Management
zh_hans: 远程仓库管理
zh_hk: 遠端倉庫管理

source: Remote URL
zh_hans: 远程 URL
zh_hk: 遠端 URL

source: Remote Repository
zh_hans: 远程仓库
zh_hk: 遠端倉庫

source: Save
zh_hans: 保存
zh_hk: 儲存

source: Upstream
zh_hans: 上游
zh_hk: 上游

# 远程仓库管理
source: Remote repository management
zh_hans: 远程仓库管理
zh_hk: 遠端倉庫管理
